Revit 2026 API

# LinePatternSegmentType Enumeration

---

Represents the type of a line pattern segment.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum LinePatternSegmentType
```
```vb
Public Enumeration LinePatternSegmentType
```
```cpp
public enum class LinePatternSegmentType
```
```fsharp
type LinePatternSegmentType
```

| Member name | Value | Description |
| --- | --- | --- |
| Dash | 0 | A dash |
| Dot | 2 | A dot |
| Invalid | 3 |  |
| Space | 1 | A space |

#### Reference

Autodesk.Revit.DB Namespace